In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../lecture5/titanic.csv')
df.shape

(2207, 11)

In [3]:
df.head(4)

,name,gender,age,class,embarked,country,ticketno,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,5547.0,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,2673.0,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,2673.0,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,2673.0,20.05,1.0,1.0,yes

In [4]:
df.isna().sum()

name          0
gender        0
age           2
class         0
embarked      0
country      81
ticketno    891
fare        916
sibsp       900
parch       900
survived      0
dtype: int64

In [5]:
df.describe()

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
25%      22.000000  1.426225e+04     7.180600     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
75%      38.000000  3.470770e+05    31.060750     1.000000     0.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [6]:
df.describe(percentiles=[0.01, .1, .2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 0.99])

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
1%        2.000000  7.668500e+02     6.150000     0.000000     0.000000
10%      18.000000  2.668000e+03     7.140800     0.000000     0.000000
20%      21.000000  1.166800e+04     7.170600     0.000000     0.000000
30%      24.000000  1.758100e+04     8.010000     0.000000     0.000000
40%      26.000000  2.840300e+04    11.020800     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
60%      32.000000  2.376680e+05    22.070200     0.000000     0.000000
70%      36.000000  3.309755e+05    27.140500     1.000000     0.000000
80%      40.000000  3.492170e+05    42.080000     1.000000     1.000000
90%      46.000000  3.686375e+05    78.050400     1.000000     2.000000
99%      63.000000  3.101304e+06   262.070600     5.000000     4.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [7]:
df['age'].quantile(0.01)

2.0

In [8]:
# remove unnecessary column

df.drop('ticketno', axis=1).head(1)

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no

In [9]:
# remove unnecessary column (A better way)

del df['ticketno']

Navigating dataframe

In [10]:
# select specific data

df.at[0, 'age']

42.0

In [11]:
# get the index name
df.index.name

In [12]:
df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [13]:
df.loc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

In [14]:
# change the index to a string column 'name' and use .loc and .iloc

df = df.set_index(df['name'])

df.index.name

'name'

In [15]:
df.loc['Abbott, Mr. Eugene Joseph']

name        Abbott, Mr. Eugene Joseph
gender                           male
age                              13.0
class                             3rd
embarked                            S
country                 United States
fare                            20.05
sibsp                             0.0
parch                             2.0
survived                           no
Name: Abbott, Mr. Eugene Joseph, dtype: object

In [16]:
# does not work cause of string index

df.iloc['Abbott, Mr. Eugene Joseph']

TypeError: Cannot index by location index with a non-integer key

In [17]:
df.loc[1:4]

TypeError: cannot do slice indexing on Index with these indexers [1] of type int

In [18]:
df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
name,,,,,,,,,,
"Abbott, Mr. Eugene Joseph","Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
"Abbott, Mr. Rossmore Edward","Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
"Abbott, Mrs. Rhoda Mary 'Rosa'","Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [19]:
df.reset_index(drop=True, inplace=True)

df.head(1)

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no

conditional navigation

In [20]:
df[df['gender'] == 'female'].shape

(489, 10)

In [21]:
# create a sub-table

female_df = df[df['gender'] == 'female']
female_df.shape

(489, 10)

In [22]:
# create a sub-table with multiple condition using logical 'and'

female_df = df[(df['gender'] == 'female') & (df['age'] > 50)]
female_df.shape

(36, 10)

In [23]:
# create a sub-table with multiple condition using logical 'or'

female_df = df[(df['gender'] == 'female') | (df['age'] > 50)]
female_df.shape

(585, 10)

In [26]:
# create a sub-table with multiple condition using logical 'or', and

df[((df['gender'] == 'female') & (df['age'] > 50)) | (df['gender'] == 'male') & (df['age'] < 20)].shape

(244, 10)

In [27]:
# replace values with new labels in a categorical column

df['gender'].replace(['female', 'male'], ['W', 'M']).head(5)

0    M
1    M
2    M
3    W
4    W
Name: gender, dtype: object

In [28]:
# create a new columns

df['sex'] = df['gender'].replace(['female', 'male'], [1, 0])
# does not count null, NAN values
df['sex'].value_counts()

sex
0    1718
1     489
Name: count, dtype: int64

In [29]:
# get the count of unique values in a categorical column

df['gender'].value_counts(dropna=False)

gender
male      1718
female     489
Name: count, dtype: int64

In [30]:
df['survived_indicator'] = df['survived'].replace(['yes', 'no'], [1, 0])

df.survived_indicator.value_counts(dropna=False)

survived_indicator
0    1496
1     711
Name: count, dtype: int64

### CrossTabs

cross tabulation - is a useful analysis tool used to compare result of one variable with another result of another variable

In [31]:
pd.crosstab(df['sex'], df['gender'], margins=True, margins_name='total')

gender  female  male  total
sex
0            0  1718   1718
1          489     0    489
total      489  1718   2207

In [157]:
# crosstab = pd.crosstab(
#             df["survived"],[df["gender"],df["class"]],margins=True,margins_name="total")

In [158]:
crosstab = pd.crosstab(df['survived'], [df['gender'], df['class']], margins=True, margins_name='total')

crosstab.to_csv('./crosstab.csv')

In [159]:
del crosstab

In [32]:
# rename a column

# column => old_name: new_name
df.rename(columns={'class': 'passenger_class'}, inplace=True)
df.head(1)

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_indicator
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no,0,0

In [37]:
# count the missing values in a given column

df[df['age'].isna()].shape[0]

2

In [38]:
print(type(df[df['age'].notna()].shape))
print(df[df['age'].notna()].shape)
print(df[df['age'].notna()].shape[0])

<class 'tuple'>
(2205, 12)
2205

Unique values

In [39]:
# count unique countries in dataframe

df['country'].nunique()

48

In [40]:
df['country'].unique()

array(['United States', 'England', 'Norway', 'France', 'Lebanon',
       'Finland', 'Sweden', 'Argentina', 'Canada', 'Denmark',
       'Northern Ireland', 'Bulgaria', 'Switzerland', 'Channel Islands',
       'Bosnia', 'Hungary', nan, 'Ireland', 'Italy', 'India', 'Wales',
       'South Africa', 'Croatia (Modern)', 'Scotland', 'Siam', 'Uruguay',
       'Belgium', 'Poland', 'Australia', 'Peru', 'Spain', 'Egypt',
       'Japan', 'Syria', 'Russia', 'Slovenia', 'Greece', 'Turkey',
       'China/Hong Kong', 'Austria', 'Latvia', 'Yugoslavia',
       'Slovakia (Modern day)', 'Germany', 'Croatia', 'Cuba',
       'Netherlands', 'Mexico', 'Guyana'], dtype=object)

In [41]:
df['country'].value_counts(dropna=False)

country
England                  1125
United States             264
Ireland                   137
Sweden                    105
NaN                        81
Lebanon                    71
Finland                    54
Scotland                   36
Canada                     34
France                     26
Norway                     26
Belgium                    22
Northern Ireland           21
Wales                      20
Bulgaria                   19
Switzerland                18
Channel Islands            17
Croatia (Modern)           12
Croatia                    11
Italy                      11
Spain                       9
India                       8
Hungary                     7
Denmark                     7
Argentina                   7
South Africa                6
Germany                     6
Turkey                      6
Australia                   5
Slovenia                    4
Bosnia                      4
Poland                      3
Austria                     3
Netherlands                 2
Greece                      2
Siam                        2
Russia                      2
Peru                        2
Uruguay                     2
Syria                       1
China/Hong Kong             1
Japan                       1
Latvia                      1
Yugoslavia                  1
Slovakia (Modern day)       1
Egypt                       1
Cuba                        1
Mexico                      1
Guyana                      1
Name: count, dtype: int64

In [42]:
df['country'].value_counts(dropna=False).sum()

2207

In [43]:
pd.crosstab(df['country'], df['survived_indicator'], margins=True, margins_name='total')

survived_indicator        0    1  total
country
Argentina                 7    0      7
Australia                 5    0      5
Austria                   2    1      3
Belgium                  17    5     22
Bosnia                    4    0      4
Bulgaria                 19    0     19
Canada                   19   15     34
Channel Islands           9    8     17
China/Hong Kong           0    1      1
Croatia                  11    0     11
Croatia (Modern)         10    2     12
Cuba                      1    0      1
Denmark                   6    1      7
Egypt                     0    1      1
England                 831  294   1125
Finland                  37   17     54
France                   11   15     26
Germany                   3    3      6
Greece                    2    0      2
Guyana                    1    0      1
Hungary                   6    1      7
India                     2    6      8
Ireland                  90   47    137
Italy                     9    2     11
Japan                     0    1      1
Latvia                    1    0      1
Lebanon                  40   31     71
Mexico                    1    0      1
Netherlands               2    0      2
Northern Ireland         17    4     21
Norway                   19    7     26
Peru                      1    1      2
Poland                    1    2      3
Russia                    1    1      2
Scotland                 28    8     36
Siam                      0    2      2
Slovakia (Modern day)     1    0      1
Slovenia                  3    1      4
South Africa              4    2      6
Spain                     2    7      9
Sweden                   77   28    105
Switzerland               7   11     18
Syria                     0    1      1
Turkey                    4    2      6
United States           112  152    264
Uruguay                   2    0      2
Wales                    17    3     20
Yugoslavia                1    0      1
total                  1443  683   2126

In [44]:
# create a new df with 3 columns -> survived and country, % of survival
# sort based on population total
# probability of survival

survival_prob = pd.crosstab(df['country'], df['survived_indicator'], margins=True, margins_name='Total')

survival_prob['percent_Survived'] = round(survival_prob[1] / survival_prob['Total'] * 100)
survival_prob.sort_values(by='percent_Survived', ascending=False)

survived_indicator        0    1  Total  percent_Survived
country
Japan                     0    1      1             100.0
Syria                     0    1      1             100.0
Egypt                     0    1      1             100.0
Siam                      0    2      2             100.0
China/Hong Kong           0    1      1             100.0
Spain                     2    7      9              78.0
India                     2    6      8              75.0
Poland                    1    2      3              67.0
Switzerland               7   11     18              61.0
United States           112  152    264              58.0
France                   11   15     26              58.0
Russia                    1    1      2              50.0
Germany                   3    3      6              50.0
Peru                      1    1      2              50.0
Channel Islands           9    8     17              47.0
Canada                   19   15     34              44.0
Lebanon                  40   31     71              44.0
Ireland                  90   47    137              34.0
Turkey                    4    2      6              33.0
South Africa              4    2      6              33.0
Austria                   2    1      3              33.0
Total                  1443  683   2126              32.0
Finland                  37   17     54              31.0
Sweden                   77   28    105              27.0
Norway                   19    7     26              27.0
England                 831  294   1125              26.0
Slovenia                  3    1      4              25.0
Belgium                  17    5     22              23.0
Scotland                 28    8     36              22.0
Northern Ireland         17    4     21              19.0
Italy                     9    2     11              18.0
Croatia (Modern)         10    2     12              17.0
Wales                    17    3     20              15.0
Hungary                   6    1      7              14.0
Denmark                   6    1      7              14.0
Greece                    2    0      2               0.0
Slovakia (Modern day)     1    0      1               0.0
Netherlands               2    0      2               0.0
Cuba                      1    0      1               0.0
Mexico                    1    0      1               0.0
Guyana                    1    0      1               0.0
Croatia                  11    0     11               0.0
Bulgaria                 19    0     19               0.0
Bosnia                    4    0      4               0.0
Latvia                    1    0      1               0.0
Uruguay                   2    0      2               0.0
Australia                 5    0      5               0.0
Yugoslavia                1    0      1               0.0
Argentina                 7    0      7               0.0

Grouping

In [45]:
df['company'] = df['sibsp'] + df['parch']
df.groupby('gender')['company'].mean()

gender
female    1.285408
male      0.663496
Name: company, dtype: float64

In [46]:
df.groupby('gender')['age'].mean()

gender
female    29.042434
male      30.843969
Name: age, dtype: float64

In [47]:
pd.DataFrame(df.groupby(['gender', 'survived_indicator'])['age'].mean())

                                 age
gender survived_indicator
female 0                   26.053846
       1                   30.124652
male   0                   31.292461
       1                   29.106061

In [51]:
df.groupby(['gender'])['age'].count()

gender
female     489
male      1716
Name: age, dtype: int64

In [52]:
df.groupby('gender')['name'].count()

gender
female     489
male      1718
Name: name, dtype: int64

In [53]:
df.groupby('gender').count()

,name,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_indicator,company
gender,,,,,,,,,,,,
female,489,489,489,489,464,466,466,466,489,489,489,466
male,1718,1716,1718,1718,1662,825,841,841,1718,1718,1718,841

In [54]:
df.groupby('gender').apply(lambda col: col.count())

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex,survived_indicator,company
gender,,,,,,,,,,,,,
female,489,489,489,489,489,464,466,466,466,489,489,489,466
male,1718,1718,1716,1718,1718,1662,825,841,841,1718,1718,1718,841

In [55]:
def uppercase(s):
    return s.upper()

In [56]:
df['new_col'] = df['name'].apply(uppercase)
df['new_col'].head()

0               ABBING, MR. ANTHONY
1         ABBOTT, MR. EUGENE JOSEPH
2       ABBOTT, MR. ROSSMORE EDWARD
3    ABBOTT, MRS. RHODA MARY 'ROSA'
4       ABELSETH, MISS. KAREN MARIE
Name: new_col, dtype: object

In [57]:
for x in df['name'][:3]:
    print(x.upper())

ABBING, MR. ANTHONY
ABBOTT, MR. EUGENE JOSEPH
ABBOTT, MR. ROSSMORE EDWARD

In [58]:
[w.upper() for w in df['name'][:2]]

['ABBING, MR. ANTHONY', 'ABBOTT, MR. EUGENE JOSEPH']

### Concatenating two DataFrames

In [59]:
data_a = {
    'id': ['1', '2', '3'],
    'first': ['Alex', 'Amy', 'Allen'],
    'last': ['Anderson', 'Ackerman', 'Ali']
}

dataframe_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])

In [60]:
data_b = {
    'id': ['4', '5', '6'],
    'first': ['Billy', 'Brian', 'Bran'],
    'last': ['Blonder', 'Black', 'Balwner']
}

# try with this
# data_b = {
#     'student_id': ['4', '5', '6'],
#     'first': ['Billy', 'Brian', 'Bran'],
#     'last': ['Blonder', 'Black', 'Balwner']
# }

dataframe_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

In [61]:
pd.concat([dataframe_a, dataframe_b])

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy   Blonder
1  5  Brian     Black
2  6   Bran   Balwner

In [62]:
x = pd.concat([dataframe_a, dataframe_b], axis=0)
x

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy   Blonder
1  5  Brian     Black
2  6   Bran   Balwner

In [63]:
y = pd.concat([dataframe_a, dataframe_b], axis=1)
y

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy  Blonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

MERGE (JOIN)

In [64]:
employee_data = {
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Hortons']
}

employee_dataframe = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

employee_dataframe

  employee_id         name
0           1    Amy Jones
1           2   Allen Keys
2           3   Alice Bees
3           4  Tim Hortons

In [65]:
sales_data = {
    'employee_id': ['3', '4', '5', '6'],
    'total_sales': [23456, 2512, 2345, 1445]
}

sales_dataframe = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

sales_dataframe

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1445

In [66]:
pd.merge(employee_dataframe, sales_dataframe, on='employee_id')

  employee_id         name  total_sales
0           3   Alice Bees        23456
1           4  Tim Hortons         2512

if name is different on both column

left_on, right_on

if you don't specify the type of join then the default is inner-join

In [67]:
pd.merge(employee_dataframe, sales_dataframe, on='employee_id', how='outer')

  employee_id         name  total_sales
0           1    Amy Jones          NaN
1           2   Allen Keys          NaN
2           3   Alice Bees      23456.0
3           4  Tim Hortons       2512.0
4           5          NaN       2345.0
5           6          NaN       1445.0

In [68]:
pd.merge(employee_dataframe, sales_dataframe, left_on='employee_id', right_on='employee_id')

  employee_id         name  total_sales
0           3   Alice Bees        23456
1           4  Tim Hortons         2512

In [196]:
# TODO

# use set index on both dataframes and make sure the index is the employee_id
# use left_index and right_index on the dataframe to merge